Revit 2027 API
FabricArea.HostId Property
 The id of the Host element for the fabric area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostId { get; }
Public ReadOnly Property HostId As ElementId
	Get
public:
property ElementId^ HostId {
	ElementId^ get ();
}
member HostId : ElementId with get
Property Value
ElementId
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace